/*==========================================================
*   1. 새로운 앱 만들기
==========================================================*/
// npm install -g create-react-app
// create-react-app my-app
//
// cd my-app
// npm start





/*==========================================================
*   2. component의 생명주기(Life cycle)
==========================================================*/
// 이거 하나로 충분하다!
// https://cdn-images-1.medium.com/max/1600/0*VoYsN6eq7I_wjVV5.png





/*==========================================================
*   3. state란?
==========================================================*/
// state는 말그대로 component의 상태를 나타낸다. 상태는 사용자가 원하는대로 정할 수 있다.
// component의 constructor 내부에 작성한다.
...
constructor(props) {
  super(props);
  this.state = {
    a: 1,
    ...
  };
}
...

// state에 변화가 생기면 현재의 component만 다시 render가 된다.
// state에 변화를 주려면 setState를 해주면 된다.
...
this.setState({
  a: 2,
  ...
});
...
